package com.example.ninefourone.nutritionmaster.bean;

import java.io.Serializable;
import java.util.List;

public class MenuClassification implements Serializable{

    /**
     * classification : 川菜
     * cure_occupation : []
     * menu_effect : ["三色鲍脯","三色鸡酪","三菇冬瓜汤","三菌烩蛇段","三鲜乌鱼汤","三鲜参片汤","三鲜猪肝汤","下饭的素版麻婆豆腐","丝瓜鱼肚卷","五更豆酥鱼","元鱼烧鸡","冬苋菜豆腐汤","冬菜排骨汤","凉拌马齿苋","凉粉","十全乌鸡汤","南瓜蹄花汤","南瓜鲜带","咖喱兔肉","四川凉面","四川水煮牛肉","四川腊味香肠","回锅肉","园林香液鸡","多味瓜卷","大蒜烧鳝鱼","天麻乳鸽盅","奶油鱼肚","姜汁墨斗鱼丝","姜汁蹄花","姜芽炒兔丝","宫保肉丁","家常热味肘子","家常牛蹄筋","家常田鸡","家常臊子鱼","小笼牛肉","小米椒爆仔兔","尖椒北极贝","尖椒炒鲫鱼","川味砂锅之萝卜羊排","川蒜烧鲶鱼","巴国三菌蛇段汤","巴国冬瓜盅","巴国南瓜汤","巴国大排","巴国家常扣肉","巴国寨子鸡","巴国燕翅羹","巴国片皮鸭","巴国腊味拼盘","巴国辣香蛇","巴国钵钵兔","巴国风味兔","带丝全鸭","干煸兔丝","干煸冬笋","干煸青椒苦瓜","干豇豆排骨汤","干贝三圆","开水菜头","怪味鹿肉","扣肉仔兔","拌侧耳根","拌猪耳朵","旱蒸全鸡","时蔬肉丸汤","明炉三菌甲鱼汤","明炉三鲜鱼头汤","明炉什锦菊花锅","明炉酸萝卜鱼片汤","明虾烧粉丝","朝天锅","松仁鸡米","板栗烧凤翅","果味脯酥鱼","果蔬牛蛙","椒盐八炸鸡","椒盐脆鳝","椒盐蛇衣","椒盐鹅黄肉","椒麻腰片","正宗经典川菜麻婆豆腐","水煮牛柳","水煮财鱼","水豆豉鸭舌","永川豉汁排骨","泡椒圣子王","泡椒羊杂","泡椒鳝鱼","泡蛋汤","泡豇豆煸鲫鱼","洋参乌鸡汤","活捉青笋尖","海带卷","海带肘子汤","海白菜烧猪耳","淮杞牛鞭汤","清水菜头","清汤燕窝","清汤鱿鱼方","清炖羊肉汤","清蒸花鲢鱼头","清蒸鲫鱼3","滑嫩牛肉丝","滑炒蟹肉","火爆腰花2","火锅鸡","炖节瓜盅","炝圆白菜卷","炝豆芽菜","炮筒鳝鱼","炸桃腰","炸脆鳝","烩三色鱼丸","烩两色虾丸","煎焖虾饼","煎苦瓜鸡粒饼","熏豆腐干","熘鸡丝","猕猴桃甜烧白","玛瑙豆腐汤","珊瑚鱼条","生菜大明虾","番茄土豆丝","番茄炖兔","番茄炖鸡","番茄虾仁","番茄鸡蛋竹荪汤","白果乌鸡汤","白油猪肝","盐烧蟹","盐白菜爆鸭舌","砂锅鱼头汤","空心菜炝玉米","竹荪蝴蝶鱼肚汤","粉蒸泥鳅","粉蒸肥肠","粉蒸辣鲫鱼","糖醋茄饼","素牛肉","素蒸咸烧白","素鸡豆花","红烧刺参","红烧豆腐鳝段","红烧鱼肉","红烧鸭/红烧鸭子","红苕粉烧鳝鱼","绍子海参","羊杂汤","老干妈爆鸭舌","肉片汤","肚条豆芽汤","脆皮肠头","腊肉炖萝卜","腊肉绿豆汤","芙蓉红","芙蓉蒸海蟹","芝麻海参排","芝麻脊片","芥末扇贝","花椒油拌鲜芦笋","花菇油菜心","芳香排骨","芽菜烧肚条","苦瓜蒸肉丸","萝卜炖羊排","葱油滑菇","葱烧鲫鱼","葱茸竹荪","葱辣大虾","蒜汁时蔬","蒜烧海蟹","蒸渣肉","蒸芋头","蕉条茄子","虫草龟蛇汤","蜜柚烧牛蛙","西芹香辣兔","解馋瘦身菜宫保杏鲍菇","豆瓣活鲤","豆瓣鲜鱼面","豆瓣鲤鱼","豆腐丸子","豆腐虾仁","豆腐鲤鱼","豆花鱼","豆茸扣肉","豆豉鱼","豉汁蟠龙鳗","贵妃鸡翼","软炸兔糕","软炸烧白","辣味狗肉","辣味茄子","酒醉桃仁","酥炸大豆糕","酥炸茄饼","酥炸虾排","酥炸金片","酥炸鸭片","酱油鸡","酱烧冬笋","酱烧小黄鱼","酱蛤蜊","酸菜双瓜汤","酸菜蹄筋汤","酸菜鲈鱼汤","酸萝卜马蹄炖鸭","酸辣五丝汤","酸辣韭黄蛋花汤","醋烹土豆丝","金钩烘蛋","金银脑花","银鱼掐菜","锅烧肉","雪银虾饼","雪魔芋烧鹅掌","青椒玉米","青椒茄泥","青菜狮子头","香炸粉蒸肉","香炸麻辣牛排","香菇鱼块","香辣鲫鱼","香酥蛇段","魔芋海参","鱼仔蛋烩萝卜","鱼香回锅鸭","鱼香排骨","鱼香煎羊排","鱼香瓦块鱼","鱼香番茄过江","鱼香虾糕","鲍鱼鸽蛋","鲜熘竹荪蛋","鲜菜鱼皮","鸡蓉鲍片","麻辣牛筋","麻辣牛肉丁","麻辣牛肉干","麻辣牛肉条","麻辣香水鱼","麻香耗儿鱼","黄焖海参","黄瓜皮蛋汤","黄豆芽排骨汤","龙井鲍片"]
     */

    private String classification;
    private List<?> cure_occupation;
    private List<String> menu_effect;

    public String getClassification() {
        return classification;
    }

    public void setClassification(String classification) {
        this.classification = classification;
    }

    public List<?> getCure_occupation() {
        return cure_occupation;
    }

    public void setCure_occupation(List<?> cure_occupation) {
        this.cure_occupation = cure_occupation;
    }

    public List<String> getMenu_effect() {
        return menu_effect;
    }

    public void setMenu_effect(List<String> menu_effect) {
        this.menu_effect = menu_effect;
    }

    @Override
    public String toString() {
        return "MenuClassification{" +
                "classification='" + classification + '\'' +
                ", cure_occupation=" + cure_occupation +
                ", menu_effect=" + menu_effect +
                '}';
    }
}
