package com.example.ninefourone.nutritionmaster.bean;

public class Trick {

    /**
     * id : 124
     * title : 一天喝一杯红酒 真能降血脂降固醇吗
     * content : 随着高血脂、高固醇患者人数不但增长，关于如何对这类疾病进行有效地预防，成了越来越多人关注的问题，坊间关于预防的方式也多种多样，让人眼花缭乱，真假难辨。其中每天坚持喝一杯
     能降血脂降固醇的说法被很多人奉为圭臬，并在生活中践行。
     事实果真如此吗?红酒有这么突出的功效吗?下面为大家详细解答一番。
     首先，可以确定的是，红酒的确是一种健康饮品，它含有丰富的营养物质，
     功效也不容忽视。红酒中所含的多酚、白藜芦醇、花色苷等营养物质，的确有助于降低体内的胆固醇、血脂;非但如此，这些物质还能起到软化血管的作用;此外，红酒中的有机酸，还能增强我们的消化系统，帮助我们消化食物。再者，红酒中含有的多酚、黄酮等植物化学成分，有助于清除体内自由基，预防衰老。
     由此可见，饮用红酒的确对我们降脂、降固醇有很大的帮助，但是要想完全通过每天一杯红酒的方式实现预防目的，并不可取，因为红酒虽好，但同样存在下面这些隐患。
     首先对红酒的选择，市场上各种质量的红酒类型鱼目混杂，如果选择了低劣的红酒，不但不能起到养生作用，反而会危害健康;此外，红酒中含有酒精，一旦饮用过量，对高血脂、高固醇患者的健康也会造成影响;再者，红酒中能降血脂、降固醇的营养物质含量较低，每天仅喝一杯，很难奏效。
     可见，仅仅通过每天饮用一杯红酒的方式降血脂、降固醇并不是明智之选。那么，还有哪些方式可以帮助我们更好地实现养生目标呢?
     在日常饮食方面，做到膳食结构完整，营养摄入全面，保证肉质、蔬菜、水果、蛋类等各类食材的均衡摄入;再此基础上，减少食盐、食用油的摄入量，还可以尝试用鸡肉、鱼肉等“白肉”取代猪肉等“红肉”。
     高血脂、高固醇的出现，和体内过量的脂肪密不可分，每天坚持适量的体育锻炼，将体内多余的热量和脂肪消耗掉，对降低体内的血脂、固醇也大有裨益。
     养生是一个循序渐进的过程，不能急功近利，更不能偏信，某一种食材具有特殊功效这种说法，只有长期坚持健康的生活方式才能拥有健康的身体。
     */

    private int id;
    private String title;
    private String content;

    public int getId() {
        return id;
    }

    public void setId(int id) {
        this.id = id;
    }

    public String getTitle() {
        return title;
    }

    public void setTitle(String title) {
        this.title = title;
    }

    public String getContent() {
        return content;
    }

    public void setContent(String content) {
        this.content = content;
    }
}
